Infineon/cce-mtb-psoc6-bt-a2dp-source/source/sw_codec/COMPONENT_SBC_CODEC/abstraction-layer/encoder/src/cy_audio_sw_sbc_encoder.c
/*
 * Copyright 2023, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
 */

/** @file cy_audio_sw_sbc_encoder.c
 *  Functions to perform SBC encoder operations
 *
 */


/*******************************************************************************
 *                      Includes
 ******************************************************************************/
#ifdef ENABLE_SBC_ENCODE

#include "cy_audio_sw_sbc_encoder.h"
#include "cy_audio_sw_codec_utils.h"
#include "cy_audio_sw_codecs_private.h"
#include "cy_audio_sw_sbc_encoder_private.h"
/* Config param include */
#include "cy_asc_config_sbc_encoder.h"
#include "cy_audio_sw_sbc_utils.h"

/*******************************************************************************
 *                      Macros
 ******************************************************************************/
#define SAMPLE_WIDTH 2 /*16 bit*/
/*******************************************************************************
 *                      Enumerations
 ******************************************************************************/

/*******************************************************************************
 *                      Constant
 ******************************************************************************/
const cy_audio_sw_codec_encoder_ops_t cy_audio_sw_encode_sbc = {
    .type = CY_AUDIO_CODEC_TYPE_SBC,
    .init = cy_audio_sw_sbc_encoder_init,
    .encode = cy_audio_sw_sbc_encode,
    .get_recommended_inbuf_size = cy_audio_sw_sbc_get_encoder_recommended_inbuf_size,
    .get_recommended_outbuf_size = cy_audio_sw_sbc_get_encoder_recommended_outbuf_size,
    .deinit = cy_audio_sw_sbc_encoder_deinit
};

#define SBC_UUID_2_INDEX 0
static cy_asc_sbc_encode_config_t sbc_wide_band_param[SBC_UUID_2_INDEX+1] = {
    {//0
    .allocation_method = SBC_LOUDNESS,
    .bit_pool = 26,
    .channel_mode = 0, //mono
    .sub_bands = 8,
    .sub_blocks = 15,
    .sbc_mode = SBC_MODE_WIDE_BAND,
    .uui_id = 2,
    }
};

/* Currently SBC algo supports only single instance */
static volatile bool g_instance_active = false;

#ifdef VERIFY_INPUT_FRAME_MATCH
#include "cy_utils.h"
static uint32_t FrameCount = 0;
#endif

/*******************************************************************************
 *                      Function decelerations
 ******************************************************************************/

static cy_rslt_t cy_asc_sbc_encode_frame(
            sbc_encoder_handle_t sbc_object_hdl, uint8_t *pcm_bytes,
            uint32_t buff_sz, uint8_t *sbc_buff, uint32_t *out_bytes );

static cy_rslt_t cy_asc_configure_and_init_sbc_encoder( SBC_ENC_PARAMS *enc,
                                    const cy_audio_sw_codec_encode_config_t *codec_config);

static void cy_asc_destroy_sbc_encoder(sbc_encoder_handle_t handle);

static cy_rslt_t cy_asc_create_sbc_enc_internal_hdl(
                        sbc_encoder_handle_t * a_handle,
                        const cy_audio_sw_codec_encode_config_t *codec_config);

/*******************************************************************************
 *                      Function definations
 ******************************************************************************/

static cy_rslt_t cy_asc_is_valid_sbc_enc_config(const cy_audio_sw_codec_encode_config_t *codec_config)
{
    cy_asc_sbc_encode_config_t sbc = codec_config->codec_specific_config.sbc;

    cy_asc_log_info("config pram Bit: %d, CH: %d, SR: %d"
                        , codec_config->bitwidth
                        , codec_config->channel
                        , codec_config->sampling_rate );

    cy_asc_log_info("config pram sbc band:%u block:%u AM:%u CH mode:%u bit_pool:%u sbc mode:%u uui_id:%u"
                                ,sbc.sub_bands
                                ,sbc.sub_blocks
                                ,sbc.allocation_method
                                ,sbc.channel_mode
                                ,sbc.bit_pool
                                ,sbc.sbc_mode
                                ,sbc.uui_id );

    if( !((codec_config->bitwidth > CY_AUDIO_CODEC_BITWIDTH_UNKNOWN) &&\
        (codec_config->bitwidth < CY_AUDIO_CODEC_BITWIDTH_32) &&\
        (codec_config->channel > CY_AUDIO_CODEC_CHANNEL_UNKNOWN) &&\
        (codec_config->channel < CY_AUDIO_CODEC_CHANNEL_MAX ) &&\
        (codec_config->sampling_rate > CY_AUDIO_CODEC_SAMPLING_RATE_UNKNOWN) &&\
        (codec_config->sampling_rate < CY_AUDIO_CODEC_SAMPLING_RATE_MAX) ) )
    {
        cy_asc_log_err(CY_RSLT_ASC_BAD_ARG, "Invalid config pram Bit: %d, CH: %d, SR: %d"
                                , codec_config->bitwidth
                                , codec_config->channel
                                , codec_config->sampling_rate );
        return CY_RSLT_ASC_BAD_ARG;
    }

    if(codec_config->bitwidth !=  CY_AUDIO_CODEC_BITWIDTH_16 )
    {
        cy_asc_log_err(CY_RSLT_ASC_BAD_ARG, "Currently sbc mw is tested with only 16bit audio samples.");
        return CY_RSLT_ASC_BAD_ARG;
    }

    /**
     * SBC mode,  0 for A2DP mode, 1 for WideBand mode
     */
    if( sbc.sbc_mode != SBC_MODE_A2DP &&  sbc.sbc_mode != SBC_MODE_WIDE_BAND)
    {
        cy_asc_log_err(CY_RSLT_ASC_BAD_ARG, "Invalid channel mode: %u",sbc.sbc_mode);
        return CY_RSLT_ASC_BAD_ARG;
    }

