Infineon/cce-mtb-psoc6-bt-a2dp-source/source/sw_codec/COMPONENT_SBC_CODEC/abstraction-layer/encoder/src/cy_audio_sw_sbc_encoder.c
    if(sbc.sbc_mode == SBC_MODE_A2DP)
    {
        /**
         *  Number of sub bands - (4 or 8)
         */
        if( sbc.sub_bands != 4 && sbc.sub_bands != 8 )
        {
            cy_asc_log_err(CY_RSLT_ASC_BAD_ARG, "Invalid sub band: %u",sbc.sub_bands);
            return CY_RSLT_ASC_BAD_ARG;
        }

        /**
         * Number of sub blocks (4 or 8 or 12 or 16)
         */
        if( sbc.sub_blocks != 4 && sbc.sub_blocks != 8 &&\
            sbc.sub_blocks != 12 && sbc.sub_blocks != 16)
        {
            cy_asc_log_err(CY_RSLT_ASC_BAD_ARG, "Invalid sub block: %u",sbc.sub_blocks);
            return CY_RSLT_ASC_BAD_ARG;
        }

        /**
         * Allocation method (Loudness:0 (SBC_LOUDNESS) , SNR: 1(SBC_SNR))
         */
        if( sbc.allocation_method != SBC_LOUDNESS &&  sbc.allocation_method != SBC_SNR)
        {
            cy_asc_log_err(CY_RSLT_ASC_BAD_ARG, "Invalid allocation method: %u",sbc.allocation_method);
            return CY_RSLT_ASC_BAD_ARG;
        }

        /**
         * channel mode (0 for mono, 1 for Dual, 2 for stereo, 3 for joint stereo)
         */
        if( sbc.channel_mode > 3 )
        {
            cy_asc_log_err(CY_RSLT_ASC_BAD_ARG, "Invalid channel mode: %u",sbc.channel_mode);
            return CY_RSLT_ASC_BAD_ARG;
        }

        /**
         * Bit pool, ranging from 2 to 250
         */
        if( sbc.bit_pool < SBC_DEC_BIT_POOL_MIN || sbc.bit_pool > SBC_DEC_BIT_POOL_MAX )
        {
            cy_asc_log_err(CY_RSLT_ASC_BAD_ARG, "Invalid bit pool: %u",sbc.bit_pool);
            return CY_RSLT_ASC_BAD_ARG;
        }



        if ( ((codec_config->channel == CY_AUDIO_CODEC_CHANNEL_MONO) && (sbc.channel_mode != 0)) ||\
            ((codec_config->channel == CY_AUDIO_CODEC_CHANNEL_STEREO) && (sbc.channel_mode == 0)) )
        {
            cy_asc_log_err(CY_RSLT_ASC_BAD_ARG, "Channel mode is not adapted for this input: CH:%d CH mode:%u",codec_config->channel,sbc.channel_mode);
            return CY_RSLT_ASC_NOT_SUPPORTED;
        }
    }
    else
    {
        if( sbc.uui_id != SBC_WB_SUPPORTED_UUID )
        {
            cy_asc_log_err(CY_RSLT_ASC_NOT_SUPPORTED, "Unsupported UUID: %u, only uuid 2 is supported",sbc.uui_id);
            return CY_RSLT_ASC_NOT_SUPPORTED;
        }

        if(codec_config->channel != CY_AUDIO_CODEC_CHANNEL_MONO)
        {
            cy_asc_log_err(CY_RSLT_ASC_NOT_SUPPORTED, "UUID: %u Support only mono channels",sbc.uui_id);
            return CY_RSLT_ASC_NOT_SUPPORTED;
        }

        if(codec_config->sampling_rate != CY_AUDIO_CODEC_SAMPLING_RATE_16000HZ)
        {
            cy_asc_log_err(CY_RSLT_ASC_NOT_SUPPORTED, "Support input sample rate:%d in wideband mode ",codec_config->sampling_rate);
            return CY_RSLT_ASC_NOT_SUPPORTED;
        }
    }

    return CY_RSLT_SUCCESS;
}

static cy_rslt_t cy_asc_sbc_get_pcm_frame_len (cy_asc_sbc_encode_config_t sbc, uint32_t *a_frameLen)
{
    uint8_t num_channels = (sbc.channel_mode == 0) ? 1 : 2;
    if(sbc.sbc_mode == SBC_MODE_WIDE_BAND)
    {
        sbc = sbc_wide_band_param[SBC_UUID_2_INDEX];
    }

    *a_frameLen = SAMPLE_WIDTH * (SBC_MAX_NUM_FRAME*sbc.sub_blocks*sbc.sub_bands*num_channels);

    return CY_RSLT_SUCCESS;
}

static cy_rslt_t cy_asc_sbc_get_encoded_frame_len (cy_asc_sbc_encode_config_t sbc, uint32_t *a_frameLen)
{
    uint8_t  num_channels, Join;
    uint32_t  FrameLen, tmp;

    if((sbc.sbc_mode == SBC_MODE_WIDE_BAND) && (sbc.uui_id != SBC_WB_SUPPORTED_UUID) )
    {
        cy_asc_log_err(CY_RSLT_ASC_NOT_SUPPORTED, "Unsupported UUID: %u, only uuid 2 is supported",sbc.uui_id);
        return CY_RSLT_ASC_NOT_SUPPORTED;
    }

    if(sbc.sbc_mode == SBC_MODE_WIDE_BAND)
    {
        sbc = sbc_wide_band_param[SBC_UUID_2_INDEX];
    }

    num_channels = (sbc.channel_mode == 0) ? 1 : 2;

    FrameLen = 4 + (4 * sbc.sub_bands * num_channels) / 8;

    Join = (sbc.channel_mode == 3) ? 1 : 0;

    if (sbc.channel_mode < 2)
        tmp =  (sbc.sub_blocks * num_channels * sbc.bit_pool);
    else
        tmp =  (Join * sbc.sub_bands + sbc.sub_blocks * sbc.bit_pool);

    FrameLen += tmp / 8 + ((tmp % 8) ? 1 : 0);

    *a_frameLen = FrameLen;

    return CY_RSLT_SUCCESS;
}

/**
 * @brief Create a sbc internal hdl object
 *
 * @param a_handle [out] - sbc object handle
 * @param codec_config [in] - encoder config
 * @return cy_rslt_t - CY_RSLT_SUCCESS on success; an error code on failure.
 */
static cy_rslt_t cy_asc_create_sbc_enc_internal_hdl(
                        sbc_encoder_handle_t * a_handle,
                        const cy_audio_sw_codec_encode_config_t *codec_config)
{
    sbc_encoder_handle_t handle = NULL;
    cy_rslt_t result = CY_RSLT_SUCCESS;
    SBC_ENC_PARAMS *enc;

    if(NULL != codec_config)
    {

        result = cy_asc_is_valid_sbc_enc_config(codec_config);
        if( CY_RSLT_SUCCESS != result )
        {
            cy_asc_log_err(CY_RSLT_ASC_BAD_ARG, "Invalid SBC config pram");
            return CY_RSLT_ASC_NOT_SUPPORTED;
        }

        /* Set initially as failure */
        result = CY_RSLT_ASC_ALGO_INIT_FAILED;

        handle = (sbc_encoder_handle_t)calloc(1,sizeof(sbc_encoder_handle));
        if(NULL == handle)
        {
            result = CY_RSLT_ASC_OUT_OF_MEMORY;
            cy_asc_log_err(result, "out of memory handle:0x%p-sz%u",handle,sizeof(sbc_encoder_handle));
            goto api_exit;
        }

        enc = (SBC_ENC_PARAMS*)calloc(1,sizeof(SBC_ENC_PARAMS));
        if(NULL == enc)
        {
            result = CY_RSLT_ASC_OUT_OF_MEMORY;
            cy_asc_log_err(result, "out of memory SBC_ENC_PARAMS:0x%p-sz%u",enc,sizeof(SBC_ENC_PARAMS));
            goto api_exit;
        }

        /* Backup the encoder handle */
        handle->encoder = enc;

        /* Configures the Encoder for CELT codec Mode */
        result = cy_asc_configure_and_init_sbc_encoder(enc,codec_config);
        if(CY_RSLT_SUCCESS == result)
        {
            handle->enc_config = *codec_config;
            cy_asc_sbc_get_pcm_frame_len(handle->enc_config.codec_specific_config.sbc, &handle->frameInfo.input_size );
            cy_asc_sbc_get_encoded_frame_len(handle->enc_config.codec_specific_config.sbc, &handle->frameInfo.output_size);

            /* Allocate memory for input buffer */
            handle->input_buff.buff         = (uint8_t *)malloc(handle->frameInfo.input_size);
            if(NULL == handle->input_buff.buff )
            {
                result = CY_RSLT_ASC_OUT_OF_MEMORY;
                cy_asc_log_err(result, "out of memory buff:0x%p-sz%lu",handle->input_buff.buff,handle->frameInfo.input_size);
                goto api_exit;
            }

