Infineon/cce-mtb-psoc6-bt-a2dp-source/source/sw_codec/COMPONENT_SBC_CODEC/abstraction-layer/encoder/src/cy_audio_sw_sbc_encoder.c
            handle->input_buff.buff_len     = handle->frameInfo.input_size;
            handle->input_buff.used_len     = 0;
            *a_handle                       = handle;
            result                          = CY_RSLT_SUCCESS;

            cy_asc_log_info("SBC config input_size: %lu output_size: %lu"
                                    , handle->frameInfo.input_size
                                    , handle->frameInfo.output_size);
        }
    }

api_exit:
    if(CY_RSLT_SUCCESS != result)
    {
        cy_asc_destroy_sbc_encoder(handle);
        *a_handle = NULL;
    }
    return result;
}

static void cy_asc_destroy_sbc_encoder(sbc_encoder_handle_t handle)
{
    if(handle)
    {
        if(handle->encoder)
        {
            /* Destroy the algo handle */
            free(handle->encoder);
            handle->encoder = NULL;
        }

        if(handle->input_buff.buff)
        {
            free(handle->input_buff.buff);
            handle->input_buff.buff = NULL;
        }

        free(handle);
    }
}

static cy_rslt_t cy_asc_configure_and_init_sbc_encoder( SBC_ENC_PARAMS *enc,
                                    const cy_audio_sw_codec_encode_config_t *codec_config)
{
    cy_rslt_t result = CY_RSLT_ASC_ALGO_INIT_FAILED;
    SINT16 err;
    cy_asc_sbc_encode_config_t sbc = codec_config->codec_specific_config.sbc;

    enc->s16NumOfSubBands       = sbc.sub_bands;
    enc->s16NumOfBlocks         = sbc.sub_blocks;
    enc->s16AllocationMethod    = sbc.allocation_method;
    enc->s16ChannelMode         = sbc.channel_mode;
    enc->s16BitPool             = sbc.bit_pool;
    enc->sbc_mode               = sbc.sbc_mode;
    enc->uui_id                 = sbc.uui_id;
    enc->s16SamplingFreq        = cy_asc_sbc_sample_rate_enum_to_value(codec_config->sampling_rate);

    // Init SBC Encoder
    err = SBC_Encoder_Init(enc);
    if ( err == SBC_FAILURE)
    {
        result = CY_RSLT_ASC_ALGO_INIT_FAILED;
        cy_asc_log_err(result,"SBC_Encoder_Init Failed err:%x",err );
        goto api_exit;
    }

    result = CY_RSLT_SUCCESS;

api_exit:
    return result;
}

static cy_rslt_t cy_asc_sbc_encode_frame(
            sbc_encoder_handle_t sbc_object_hdl, uint8_t *pcm_bytes,
            uint32_t buff_sz, uint8_t *sbc_buff, uint32_t *out_bytes )
{
    int len;
    unsigned int num_samples;
    sbc_encoder_frame_info  frameInfo = sbc_object_hdl->frameInfo;

    if(buff_sz != frameInfo.input_size)
    {
        cy_asc_log_err(CY_RSLT_ASC_INSUFFICIENT_INPUT_BUFF,"Fatal! input sz less Req:%lu buff_sz:%lu"
                                                    , frameInfo.input_size
                                                    , buff_sz );
        return CY_RSLT_ASC_INSUFFICIENT_INPUT_BUFF;
    }

#ifdef VERIFY_INPUT_FRAME_MATCH
        bool is_same = false;
        extern bool verify_enc_Inputdata(uint8_t * Data_to_encode, uint32_t Size, uint32_t a_FrameCount);
        is_same = verify_enc_Inputdata(pcm_bytes, frameInfo.input_size,FrameCount);
        CY_ASSERT (is_same == true);
#endif

     /* Encodes the PCM frame and returns the no of encoded samples */
    num_samples = buff_sz/SAMPLE_WIDTH;
    len = SBC_Encoder_encode(sbc_object_hdl->encoder, pcm_bytes, sbc_buff, num_samples);

    if (len <= 0)
    {
        cy_asc_log_err(CY_RSLT_ASC_ALGO_INTERNAL_ERROR, "sbc_encode() returned failed %d", len);
        return CY_RSLT_ASC_ALGO_INTERNAL_ERROR;
    }

    *out_bytes = len;
#ifdef VERIFY_INPUT_FRAME_MATCH
    FrameCount++;
#endif
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_audio_sw_sbc_encoder_init(
      cy_audio_sw_codec_encode_config_t *codec_config,
      cy_audio_sw_codec_t *handle)
{
    cy_audio_sw_codec_handle_t         audio_sw_hdl    = NULL;
    sbc_encoder_handle_t               codec_obj       = NULL;
    cy_rslt_t                           result          = CY_RSLT_SUCCESS;

    if(true == g_instance_active)
    {
        result  = CY_RSLT_ASC_INVALID_MAX_INSTANCE_REACHED;
        cy_asc_log_err(result, "Already a SBC encoder instance is active");
        return result;
    }

    /* Allocate memory for the handle */
    audio_sw_hdl = (cy_audio_sw_codec_handle_t)malloc(sizeof(cy_audio_sw_codec_handle));
    if(NULL == audio_sw_hdl)
    {
        result = CY_RSLT_ASC_OUT_OF_MEMORY;
        cy_asc_log_err(result, "out of memory sw codec hdl");
        goto error_return;
    }
    memset(audio_sw_hdl,0x00,sizeof(cy_audio_sw_codec_handle));

    /* Initialize API structure and set config params */
    result = cy_asc_create_sbc_enc_internal_hdl(&codec_obj,codec_config);
    if(CY_RSLT_SUCCESS != result)
    {
        cy_asc_log_err(result, "Failed to create sbc internal hdl.");
        goto error_return;
    }

    audio_sw_hdl->audio_sw_algo_object      = codec_obj;
    audio_sw_hdl->pst_audio_sw_codec_ops    = (void *)&cy_audio_sw_encode_sbc;
    /* Hardcoded here */
    audio_sw_hdl->header_schema             = CY_AUDIO_CODEC_NO_ALL_FRAME;
    *handle = audio_sw_hdl;

    cy_asc_log_dbg( "SBC encoder init success");
#ifdef VERIFY_INPUT_FRAME_MATCH
    FrameCount = 0;
#endif
    g_instance_active = true;
    return CY_RSLT_SUCCESS;

/* Do a clean return */
error_return:
    if(codec_obj)
    {
        cy_asc_destroy_sbc_encoder(codec_obj);
    }

    if(audio_sw_hdl)
    {
        free(audio_sw_hdl);
    }
    *handle = NULL;
    return result;

}

cy_rslt_t cy_audio_sw_sbc_encode(cy_audio_sw_codec_handle_t audio_sw_hdl,
      uint8_t *in_pcm_buff, uint32_t *in_pcm_data_len, uint8_t *out_buff,
      uint32_t *outbuf_len)
{
    sbc_encoder_handle_t           codec_obj           = NULL;
    cy_rslt_t                       result              = CY_RSLT_ASC_INVALID_HANDLE;
    uint32_t                        in_buff_pos         = 0;
    uint32_t                        out_buff_pos        = 0;
    // uint32_t                        header_len          = 0;
    uint32_t                        curr_enc_out_bytes  = 0;
    uint8_t                         num_frame_encode    = 0;
    uint32_t                        loop_index          = 0;
    uint32_t                        pcm_data_to_copy    = 0;
    uint32_t                        tot_pcm_data_len    = *in_pcm_data_len;
    uint32_t                        tot_outbuf_len      = *outbuf_len;
    uint8_t*                        buff_to_use         = NULL;

   codec_obj = (sbc_encoder_handle_t)audio_sw_hdl->audio_sw_algo_object;

