Infineon/cce-mtb-psoc6-bt-a2dp-source/source/sw_codec/COMPONENT_SBC_CODEC/abstraction-layer/encoder/src/cy_audio_sw_sbc_encoder.c
    /* Check for sufficient output buffer provided */
    if(false == IS_SUFFICIENT_BUFF_LEN(*outbuf_len,codec_obj->frameInfo.output_size) )
    {
        cy_asc_log_err(CY_RSLT_ASC_INSUFFICIENT_OUTPUT_BUFF, "Insufficient output buffer sz:%lu Recommended:%lu"
                                    ,*outbuf_len, (codec_obj->frameInfo.output_size) );
        *in_pcm_data_len    = 0;
        *outbuf_len         = 0;
        return CY_RSLT_ASC_INSUFFICIENT_OUTPUT_BUFF;
    }

    /* Check for sufficient input buffer to process */
    if(false == cy_asc_check_sufficient_buffer_process(&codec_obj->input_buff,
                    in_pcm_buff,*in_pcm_data_len ) )
    {
        /* Cannot encoded less data, so the data is cached internally */
        *outbuf_len = 0;
        return CY_RSLT_SUCCESS;
    }

    num_frame_encode = (*in_pcm_data_len + codec_obj->input_buff.used_len)/codec_obj->frameInfo.input_size;
    *in_pcm_data_len = 0;
    *outbuf_len      = 0;

    /* Encode one frame by one. */
    for ( loop_index = 0;
         ((loop_index < num_frame_encode) &&\
         ((out_buff_pos + codec_obj->frameInfo.output_size)  <= tot_outbuf_len));
          loop_index++  )
    {
        pcm_data_to_copy = codec_obj->frameInfo.input_size - codec_obj->input_buff.used_len;

        if(0 != codec_obj->input_buff.used_len)
        {
            memcpy( (codec_obj->input_buff.buff +codec_obj->input_buff.used_len)
                    ,(in_pcm_buff + in_buff_pos),pcm_data_to_copy);
            buff_to_use = codec_obj->input_buff.buff;
        }
        else
        {
            buff_to_use = (uint8_t*)(in_pcm_buff + in_buff_pos);
        }

        codec_obj->input_buff.used_len = 0;
        /* Size of out buff */
        curr_enc_out_bytes = codec_obj->frameInfo.output_size;

        /* Perform encode */
        result =  cy_asc_sbc_encode_frame(codec_obj,buff_to_use, codec_obj->frameInfo.input_size,
                                                (out_buff+out_buff_pos)
                                                ,&curr_enc_out_bytes);
        if(CY_RSLT_SUCCESS != result)
        {
            cy_asc_log_err(result, "Opus encode operation failed.");
            goto error_return;
        }

        /* Update the input output bytes processed */
        out_buff_pos      += curr_enc_out_bytes;
        in_buff_pos       += pcm_data_to_copy;
        *in_pcm_data_len  += pcm_data_to_copy;
        *outbuf_len        = out_buff_pos;
    }

    cy_asc_check_and_cache_any_residual_data(&codec_obj->input_buff,in_pcm_buff,*in_pcm_data_len,tot_pcm_data_len);
    *in_pcm_data_len += codec_obj->input_buff.used_len;

    cy_asc_log_dbg("frames enc'd:%lu Input[pcm:%lu, out:%lu] Processed[pcm:%lu, out:%lu] cached:%lu"
                        , loop_index, *in_pcm_data_len, *outbuf_len, in_buff_pos, out_buff_pos
                        ,codec_obj->input_buff.used_len );
    return CY_RSLT_SUCCESS;

error_return:
    return result;

}

cy_rslt_t cy_audio_sw_sbc_get_encoder_recommended_inbuf_size(
        cy_audio_sw_codec_handle_t audio_sw_hdl,
        uint32_t *recommended_in_size)
{
    sbc_encoder_handle_t        codec_obj   = NULL;
    cy_rslt_t                   result      = CY_RSLT_ASC_INVALID_HANDLE;

    if(audio_sw_hdl && audio_sw_hdl->audio_sw_algo_object)
    {
        codec_obj = (sbc_encoder_handle_t)audio_sw_hdl->audio_sw_algo_object;
        *recommended_in_size = codec_obj->frameInfo.input_size;
        result = CY_RSLT_SUCCESS;
    }
    return result;
}

cy_rslt_t cy_audio_sw_sbc_get_encoder_recommended_outbuf_size(
        cy_audio_sw_codec_handle_t audio_sw_hdl,
        uint32_t in_size,
        uint32_t *recommended_out_size)
{
    sbc_encoder_handle_t        codec_obj   = NULL;
    cy_rslt_t                   result      = CY_RSLT_ASC_INVALID_HANDLE;

    *recommended_out_size = 0;

    if(audio_sw_hdl && audio_sw_hdl->audio_sw_algo_object)
    {

        codec_obj = (sbc_encoder_handle_t)audio_sw_hdl->audio_sw_algo_object;
        if(in_size >= codec_obj->frameInfo.input_size)
        {
            *recommended_out_size   = (in_size/codec_obj->frameInfo.input_size) * \
                                      codec_obj->frameInfo.output_size;
        }
        else
        {
            *recommended_out_size   = codec_obj->frameInfo.input_size;
        }

        result = CY_RSLT_SUCCESS;
    }

    return result;
}

cy_rslt_t cy_audio_sw_sbc_encoder_deinit(cy_audio_sw_codec_t *handle)
{
    cy_audio_sw_codec_handle_t  audio_sw_hdl    = NULL;
    cy_rslt_t                   result          = CY_RSLT_ASC_INVALID_HANDLE;

    audio_sw_hdl = (cy_audio_sw_codec_handle_t)(*handle);
    if(audio_sw_hdl)
    {
        cy_asc_log_dbg("SBC encoder deinit Req ASC hdl:%p", *handle)
        if(audio_sw_hdl->audio_sw_algo_object)
        {
            cy_asc_destroy_sbc_encoder((sbc_encoder_handle_t)audio_sw_hdl->audio_sw_algo_object);
            audio_sw_hdl->audio_sw_algo_object = NULL;
        }
        free(audio_sw_hdl);
        *handle = NULL;
        g_instance_active = false;
        result = CY_RSLT_SUCCESS;
        cy_asc_log_dbg("SBC encoder deinit success sw codec");
    }

    return result;
}
#endif /* ENABLE_SBC_ENCODE */